// 0. Напишите программу, которая на входе принимает число 
// и выдает его квадрат

int number = int.Parse(Console.ReadLine());

int quarter = number * number;  
Console.WriteLine(quarter);